docs/rfcs/003-remove-group.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-20 Wed 11:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RFC003: Remove groups from product types</title>
<meta name="author" content="Simon Johnston" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./rfcs.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">RFC003: Remove groups from product types</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org137ff34">1. Introduction</a></li>
<li><a href="#org1dd788b">2. Motivation</a></li>
<li><a href="#org4264220">3. Proposed Change</a></li>
</ul>
</div>
</div>

<div id="outline-container-org137ff34" class="outline-2">
<h2 id="org137ff34"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The grammar production <code>member_group</code> seems to provide little value, any example using it seems better off with another
structure. While writing the primer it became clear that no good example could be described that motivated the group
production in a definitive way.
</p>

<p>
<b>Document Status History</b>
</p>

<table border="0" cellspacing="0" cellpadding="6" rules="none" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Status</th>
<th scope="col" class="org-left">Comment</th>
<th scope="col" class="org-left">Grammar Version</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-12-07 Thu]</span></span></td>
<td class="org-left">Draft</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>0.2.6</code></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-12-07 Thu]</span></span></td>
<td class="org-left">Proposed</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>0.2.6</code></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-12-20 Wed]</span></span></td>
<td class="org-left">Approved</td>
<td class="org-left">Removed and <a href="https://github.com/sdm-lang/tree-sitter-sdml/releases/v0.2.7">released</a>.</td>
<td class="org-left"><code>0.2.7</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1dd788b" class="outline-2">
<h2 id="org1dd788b"><span class="section-number-2">2.</span> Motivation</h2>
<div class="outline-text-2" id="text-2">
<p>
The current implementation allows for a grouping of fields in a structure such that annotations are attached to the
group not to individual members.
</p>

<div class="org-src-container">
<pre class="src src-ebnf">StructureDef
    ::= <span style="color: #2aa198;">"structure"</span> Identifier StructuredBody?

StructuredBody
    ::= <span style="color: #2aa198;">"is"</span> Annotation* StructuredBodyInner <span style="color: #2aa198;">"end"</span>

StructuredBodyInner
    ::= <span style="color: #657b83;">(</span> MemberGroup | Member <span style="color: #657b83;">)</span>+

MemberGroup
    ::= <span style="color: #2aa198;">"group"</span> Annotation* Member+ <span style="color: #2aa198;">"end"</span>
</pre>
</div>

<p>
For example, this is an excerpt from the file <code>examples/simple.sdm</code> which grouped three fields in the invoice and labeled
the group as rates applied. However, it&rsquo;s not clear what we do with this when we transform the model; does the group
represent a type? do attributes get copied to each field? is the group (and annotations) simply get discarded?
</p>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">invoice</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">entity</span> <span style="color: #268bd2;">Invoice</span> <span style="color: #859900;">is</span>
    <span style="color: #859900;">identity</span> id <span style="color: #859900;">-&gt;</span> <span style="color: #6c71c4;">integer</span>
    customer <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">customers:Customer</span>
    vehicle <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">vehicles:Vehicle</span>
    rental_dates <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">DateRange</span>
    mileage <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">OdometerRange</span>

    <span style="color: #859900;">group</span>
      <span style="color: #d33682;">@dc:description</span> <span style="color: #859900;">=</span> <span style="color: #2aa198;">"Rates applied to the rental."</span><span style="color: #268bd2; font-style: italic;">@en</span>
      day_rate <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">finance:CurrencyRate</span>
      mile_rate <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">finance:CurrencyRate</span>
      discount <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">finance:DiscountPercentage</span>
    <span style="color: #859900;">end</span>

  <span style="color: #859900;">end</span>
<span style="color: #859900;">end</span>
</pre>
</div>

<p>
It is also hard to come up with examples for the documentation where a group of this kind is preferred to a new
structure, as in the following. This would suggest that the group notion is not required as a core component of the language.
</p>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">invoice</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">entity</span> <span style="color: #268bd2;">Invoice</span> <span style="color: #859900;">is</span>
    <span style="color: #859900;">identity</span> id <span style="color: #859900;">-&gt;</span> <span style="color: #6c71c4;">integer</span>
    customer <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">customers:Customer</span>
    vehicle <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">vehicles:Vehicle</span>
    rental_dates <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">DateRange</span>
    mileage <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">OdometerRange</span>

    rates <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">RentalRates</span>
  <span style="color: #859900;">end</span>

  <span style="color: #859900;">structure</span> <span style="color: #268bd2;">RentalRates</span> <span style="color: #859900;">is</span>
    <span style="color: #d33682;">@dc:description</span> <span style="color: #859900;">=</span> <span style="color: #2aa198;">"Rates applied to the rental."</span><span style="color: #268bd2; font-style: italic;">@en</span>
    day_rate <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">finance:CurrencyRate</span>
    mile_rate <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">finance:CurrencyRate</span>
    discount <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">finance:DiscountPercentage</span>
  <span style="color: #859900;">end</span>
  
<span style="color: #859900;">end</span>
</pre>
</div>

<p>
In the case where the grouping of fields was not intended to imply a nested structure it would be possible to add an
annotation property that would affect code generation to <i>flatten</i> a structure into its parent.
</p>

<div class="org-src-container">
<pre class="src src-sdml"><span style="color: #859900;">module</span> <span style="color: #268bd2;">invoice</span> <span style="color: #859900;">is</span>
  <span style="color: #859900;">entity</span> <span style="color: #268bd2;">Invoice</span> <span style="color: #859900;">is</span>
    <span style="color: #859900;">identity</span> id <span style="color: #859900;">-&gt;</span> <span style="color: #6c71c4;">integer</span>
    // <span style="color: #859900;">..</span>.

    rates <span style="color: #859900;">-&gt;</span> <span style="color: #268bd2;">RentalRates</span> <span style="color: #859900;">is</span>
      <span style="color: #d33682;">@generator:flattened</span> <span style="color: #859900;">=</span> <span style="color: #6c71c4;">true</span>
    <span style="color: #859900;">end</span>
  <span style="color: #859900;">end</span>  
<span style="color: #859900;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4264220" class="outline-2">
<h2 id="org4264220"><span class="section-number-2">3.</span> Proposed Change</h2>
<div class="outline-text-2" id="text-3">
<p>
The following changes are required:
</p>

<ol class="org-ol">
<li>Remove the production <code>member_group</code> from the grammar.</li>
<li>Remove the production <code>_structured_body_inner</code> from the grammar.</li>
<li>Update <code>structure_body</code> and <code>entity_body</code> to include <code>repeat1(member)</code> and <code>repeat(member)</code> respectively.</li>
<li>Update queries for highlights, indents, and folds to remove <code>member_group</code> references.</li>
<li>Remove test case <code>entity_with_groups.sdm</code>.</li>
<li>Update test case <code>entity_with_unknowns.sdm</code> to remove group.</li>
<li>Update example <code>simple.sdm</code> to remove group.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Simon Johnston</p>
<p class="date">Created: 2023-12-20 Wed 11:47</p>
</div>
</body>
</html>
